# библиотеки
import turtle
import time
import random

#--------------------------экран---------------------------------
screen = turtle.Screen()
# меняем цвет экрана
screen.bgcolor('#06FFD1')
# размер экрана
screen.setup(650, 650)
# название игры 
screen.title('Змейка в соусе версия 123')
#--------------------------экран---------------------------------

#--------------------------змейка--------------------------------
snake = []
snake_segment = turtle.Turtle()
# меняет форму 
snake_segment.shape('square')
snake.append(snake_segment)
#--------------------------змейка--------------------------------

#--------------------------управление----------------------------
screen.onkeypress(lambda: snake[0].setheading(90), 'Up')
screen.listen()
#--------------------------управление----------------------------

#--------------------------игра----------------------------------
while True:
    # скорость гловы змейки
    snake[0].forward(1)
    
    # обновляет экран
    screen.update()
    
    # упраляет FPS
    time.sleep(0)
